heyjarvisai7/RF_MASTER_CODE/fun_mcode/nRF5_SDK_17.1.0_ddde560/examples/proprietary_rf/esb_prx29/main.c
       }
 
       else
       {
          if(Prev_neighbor < &Prev_neighbor_table[MAX_NEIGHBORS]) 
          {
             Prev_neighbor++;
             if(Prev_neighbor->node_id == 0)
             {
                Prev_neighbor = &Prev_neighbor_table[0];
             }
          }
          else
          {
             Prev_neighbor = &Prev_neighbor_table[0];
          }
          tx_payload.data[POS_CIRCLE_ARRAY+ Current_Circle - 1] = Prev_neighbor->node_id;

          set_slave_adress(Prev_neighbor->node_id, arrays[Current_Circle - 1]);
          sendDataToNextSlave();
       }
}

void pingPacket(void)
{
          if(circlearr1[POS_PACKET_TYPE] == 1  && circlearr1[POS_LENGTH] == 0)
          {
                memcpy(&advertisment_pcket,rx_payload.data + sizeof(header), sizeof(advertisment_pcket));
                if(rx_payload.rssi > 0 && Nxt_table_index < MAX_NEIGHBORS && advertisment_pcket.circle_no == Current_Circle +1)
                {
                      Nxt_neighbor_table[Nxt_table_index].node_id = advertisment_pcket.node_id;
                      Nxt_neighbor_table[Nxt_table_index].rssi = rx_payload.rssi;
                      Nxt_table_index++;
                }
                if(rx_payload.rssi > 0 && Prev_table_index < MAX_NEIGHBORS && advertisment_pcket.circle_no == Current_Circle - 1)
                {
                      Prev_neighbor_table[Prev_table_index].node_id = advertisment_pcket.node_id;
                      Prev_neighbor_table[Prev_table_index].rssi = rx_payload.rssi;
                      Prev_table_index++;
                }
                neighbour_no++;
                Ack_Txing = 0;

          }
          if(circlearr1[POS_PACKET_TYPE] == 1  && circlearr1[POS_LENGTH] == 1)
          {
                advertisment_pcket.circle_no = Current_Circle;
                advertisment_pcket.node_id = addr_prefix[0];
                memset(&header,0,sizeof(header));
                header.packet_type = 1;
                if(circlearr[(POS_CIRCLE_ARRAY+ Current_Circle) - 1] != 0 && (POS_CIRCLE_ARRAY+ Current_Circle) != 0)
                {
                      header.Direction = BACKWORD;
                }
                else
                {
                      header.Direction = FORWARD;
                }
                memcpy(tx_payload.data,&header,sizeof(header));
                memcpy(tx_payload.data + sizeof(header), &advertisment_pcket, sizeof(advertisment_pcket));
                tx_payload.length = sizeof(header) + sizeof(advertisment_pcket);
                check_direction(tx_payload.data);
          }
}


void clocks_start( void )
{
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART = 1;

    while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0);
}


void gpio_init( void )
{
    bsp_board_init(BSP_INIT_LEDS);
}

void nrf_set_txmode(void)
{
    uint32_t err_code;
     nrf_esb_config_t nrf_esb_config        = NRF_ESB_DEFAULT_CONFIG;
    nrf_esb_config.payload_length           = 8;
    nrf_esb_config.protocol                 = NRF_ESB_PROTOCOL_ESB_DPL;
    nrf_esb_config.bitrate                  = NRF_ESB_BITRATE_2MBPS;
    nrf_esb_config.mode                     = NRF_ESB_MODE_PTX;
    nrf_esb_config.event_handler            = nrf_esb_event_handler;
    nrf_esb_config.selective_auto_ack       = false;

    err_code = nrf_esb_init(&nrf_esb_config);
    //VERIFY_SUCCESS(err_code);
}


uint32_t esb_init( void )
{

    uint32_t err_code;

    nrf_esb_config_t nrf_esb_config         = NRF_ESB_DEFAULT_CONFIG;
    nrf_esb_config.protocol                 = NRF_ESB_PROTOCOL_ESB_DPL;
    nrf_esb_config.retransmit_count         = 1;
    nrf_esb_config.retransmit_delay         = 600;
    nrf_esb_config.bitrate                  = NRF_ESB_BITRATE_2MBPS;
    nrf_esb_config.event_handler            = nrf_esb_event_handler;
    nrf_esb_config.mode                     = NRF_ESB_MODE_PTX;
    nrf_esb_config.selective_auto_ack       = false;


    err_code = nrf_esb_init(&nrf_esb_config);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_base_address_0(arrays[Current_Circle]);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_base_address_1(base_addr_1);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_prefixes(addr_prefix, 1);
    VERIFY_SUCCESS(err_code);

    return err_code;
}

uint32_t set_slave_adress(uint8_t slaveid,uint8_t *base_address)
{

    uint32_t err_code;

    err_code = nrf_esb_set_base_address_0(base_address);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_base_address_1(base_addr_1);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_prefixes(&slaveid, 1);
    VERIFY_SUCCESS(err_code);
    nrf_esb_flush_tx();
    nrf_esb_flush_rx();


    return err_code;
}

#define	POW_CNTRL_PIN	7
uint8_t autohealing = 0;

uint8_t Diagnostic_Test = 0;
#define SCAN_PREV   (1 << 0)
#define SCAN_NEXT   (1 << 1)


void doDiagnosticTest(void)
{
    uint8_t scan_dir = 0;
    uint8_t done_rx_start = 1;

    Nxt_table_index = 0;
    Prev_table_index = 0;

    
    if (Current_Circle == MIN_CIRCLE)
        scan_dir = SCAN_NEXT;
    else if (Current_Circle == MAX_CIRCLE)
        scan_dir = SCAN_PREV;
    else
        scan_dir = SCAN_PREV | SCAN_NEXT;

    
    if (scan_dir & SCAN_PREV)
    {
        for (neighbour_no = MIN_NODES; neighbour_no < MAX_NODES; neighbour_no++)
        {
            if (Ack_Txing == 0)
            {
                diagnostic_tx(neighbour_no, Current_Circle - 1);
                done_rx_start = 1;
            }

            if (done_rx_start && Ack_Txing)
            {
                done_rx_start = 0;
                nrf_esb_flush_tx();
                nrf_esb_flush_rx();
                set_slave_adress(addr_prefix[0], arrays[Current_Circle]);
                nrf_esb_start_rx();
            }
        }

        sort_neighbors_by_rssi(Prev_neighbor_table, Prev_table_index - 1);
    }

    
    if (scan_dir & SCAN_NEXT)
    {
        for (neighbour_no = MIN_NODES; neighbour_no < MAX_NODES; neighbour_no++)
        {
            if (Ack_Txing == 0)
            {
                diagnostic_tx(neighbour_no, Current_Circle + 1);
                done_rx_start = 1;
            }

            if (done_rx_start && Ack_Txing)
            {
                done_rx_start = 0;
                nrf_esb_flush_tx();
                nrf_esb_flush_rx();
                set_slave_adress(addr_prefix[0], arrays[Current_Circle]);
                nrf_esb_start_rx();
            }
        }

