heyjarvisai7/RF_MASTER_CODE/fun_mcode/nRF5_SDK_17.1.0_ddde560/examples/proprietary_rf/esb_prx29/main.c
                }
          
                else    set_slave_adress(rx_payload.data[Current_Circle - 1],arrays[Current_Circle - 1]);
            }

      
            
         Diagnostic_Test = 0;
         Nxt_table_index = 0;
         Prev_table_index = 0;
         uint8_t done_rx_start = 1;
         if(Current_Circle == MIN_CIRCLE)
         {
             
             for(neighbour_no = 0; neighbour_no < 255 ;)
             {
                
                 if(Ack_Txing == 0)
                 {
                   nrf_esb_stop_rx();
                   set_slave_adress( neighbour_no ,arrays[Current_Circle + 1]);
                   memset(&header,0,sizeof(header));
                   header.packet_type = 1;
                   header.length = 1;
                   header.circle_array[Current_Circle] = addr_prefix[0];
                   memcpy(tx_payload.data,&header,sizeof(header));
                   memcpy(tx_payload.data + sizeof(header),"HAI",sizeof("HAI"));
                   tx_payload.length = (sizeof(header) + sizeof("HAI"));
                   done_rx_start = 1;
                    if (nrf_esb_write_payload(&tx_payload) == NRF_SUCCESS)
                    {
                        nrf_delay_us(50000); //to send the data 
                      //  set_slave_adress(addr_prefix[0],arrays[Current_Circle]);
                        
                    }
                }
                else if(done_rx_start == 1)
                {
                      done_rx_start = 0;
                      //   nrf_esb_flush_tx();
                      //  nrf_esb_flush_rx();
                      set_slave_adress(addr_prefix[0], arrays[Current_Circle]); 
                        nrf_esb_start_rx();
                }

             }
         }
         else if(Current_Circle == MAX_CIRCLE)
         {
             
             for(neighbour_no = 0; neighbour_no < 255 ;)
             {
              if(Ack_Txing == 0)
                 {
                   nrf_esb_stop_rx();
                   set_slave_adress( neighbour_no ,arrays[Current_Circle - 1]);
                   memset(&header,0,sizeof(header));
                   header.packet_type = 1;
                   header.length = 1;
                   header.circle_array[Current_Circle] = addr_prefix[0];
                   memcpy(tx_payload.data,&header,sizeof(header));
                   memcpy(tx_payload.data + sizeof(header),"HAI",sizeof("HAI"));
                   tx_payload.length = (sizeof(header) + sizeof("HAI"));
                    if (nrf_esb_write_payload(&tx_payload) == NRF_SUCCESS)
                    {
                        nrf_delay_us(50000); //to send the data 
                      //  set_slave_adress(addr_prefix[0],arrays[Current_Circle]);
                     //   nrf_esb_start_rx();
                    }
                }
                else if(done_rx_start == 1)
                {
                      done_rx_start = 0;
                      //   nrf_esb_flush_tx();
                      //  nrf_esb_flush_rx();
                      set_slave_adress(addr_prefix[0], arrays[Current_Circle]); 
                        nrf_esb_start_rx();
                }

             }
         }
        else 
         {
             
             for( neighbour_no = 0; neighbour_no < 255 ;)
             {
                    if(Ack_Txing == 0)
                    {
                          nrf_esb_stop_rx();
                          set_slave_adress( neighbour_no ,arrays[Current_Circle - 1]);
                          memset(&header,0,sizeof(header));
                          header.packet_type = 1;
                          header.length = 1;
                          header.circle_array[Current_Circle] = addr_prefix[0];
                          memcpy(tx_payload.data,&header,sizeof(header));
                          memcpy(tx_payload.data + sizeof(header),"HAI",sizeof("HAI"));
                          tx_payload.length = (sizeof(header) + sizeof("HAI"));

                          if (nrf_esb_write_payload(&tx_payload) == NRF_SUCCESS)
                          {
                              nrf_delay_us(50000); //to send the data 
                              //  set_slave_adress(addr_prefix[0],arrays[Current_Circle]);
                            //  nrf_esb_start_rx();
                          }

                          else if(done_rx_start == 1)
                          {
                                done_rx_start = 0;
                                //   nrf_esb_flush_tx();
                                //  nrf_esb_flush_rx();
                                set_slave_adress(addr_prefix[0], arrays[Current_Circle]); 
                                nrf_esb_start_rx();
                          }
                    }

             }
            for( neighbour_no = 0; neighbour_no < 255 ;)
             {
                    if(Ack_Txing == 0)
                    {
                          nrf_esb_stop_rx();
                          set_slave_adress( neighbour_no ,arrays[Current_Circle + 1]);
                          memset(&header,0,sizeof(header));
                          header.packet_type = 1;
                          header.length = 1;
                          header.circle_array[Current_Circle] = addr_prefix[0];
                          memcpy(tx_payload.data,&header,sizeof(header));
                          memcpy(tx_payload.data + sizeof(header),"HAI",sizeof("HAI"));
                          tx_payload.length = (sizeof(header) + sizeof("HAI"));
                          if (nrf_esb_write_payload(&tx_payload) == NRF_SUCCESS)
                          {
                          nrf_delay_us(50000); //to send the data 
                          //  set_slave_adress(addr_prefix[0],arrays[Current_Circle]);
                         // nrf_esb_start_rx();
                          }
                    }
                    else if(done_rx_start == 1)
                    {
                        done_rx_start = 0;
                        //   nrf_esb_flush_tx();
                        //  nrf_esb_flush_rx();
                        set_slave_adress(addr_prefix[0], arrays[Current_Circle]); 
                        nrf_esb_start_rx();
                    }

             }
         }
      }
      #endif

    
    if (NRF_LOG_PROCESS() == false)
    {
        __WFE();
    }
        
}
//}
/*lint -restore */
